{
  "version": "0",
  "id": "cd8e9e4c-d920-d76e-fff0-95aaf3688fbd",
  "detail-type": "AWS Health Event",
  "source": "aws.health",
  "account": "123456789012",
  "time": "2021-07-13T00:13:43Z",
  "region": "ap-south-1",
  "resources": [
    "i-04edd024e71b8b746"
  ],
  "detail": {
    "eventArn": "arn:aws:health:ap-south-1::event/EC2/AWS_EC2_PERSISTENT_INSTANCE_RETIREMENT_SCHEDULED/AWS_EC2_PERSISTENT_INSTANCE_RETIREMENT_SCHEDULED_7e3a4fe9-4427-4416-8e7b-f3059208a451",
    "service": "EC2",
    "eventTypeCode": "AWS_EC2_PERSISTENT_INSTANCE_RETIREMENT_SCHEDULED",
    "eventTypeCategory": "scheduledChange",
    "startTime": "Tue, 27 Jul 2021 02:00:00 GMT",
    "endTime": "Tue, 27 Jul 2021 02:00:00 GMT",
    "eventDescription": [
      {
        "language": "en_US",
        "latestDescription": "EC2 has detected degradation of the underlying hardware hosting your Amazon EC2 instance associated with this event in the ap-south-1 region. Due to this degradation your instance could already be unreachable. We will stop your instance after 2021-07-27 02:00:00 UTC. Please take appropriate action before this time.\\n\\nYou can find more information about retirement events scheduled for your EC2 instances in the AWS Management Console https://console.aws.amazon.com/ec2/v2/home?region=ap-south-1#Events\\n\\n* What will happen to my instance?\\nYour instance will be stopped after the specified retirement date. You can start it again at any time after it’s stopped. Any data on local instance-store volumes will be lost when the instance is stopped or terminated.\\n\\n* What do I need to do?\\nWe recommend that you stop and start the instance which will migrate the instance to a new host. Please note that any data on your local instance-store volumes will not be preserved when you stop and start your instance. For more information about stopping and starting your instance, and what to expect when your instance is stopped, such as the effect on public, private and Elastic IP addresses associated with your instance, see Stop and Start Your Instance in the EC2 User Guide (https://docs.aws.amazon.com/en_us/AWSEC2/latest/UserGuide/Stop_Start.html). However, if you do not need this instance, you can stop it at any time yourself or wait for EC2 to stop it after the retirement date.\\n\\n* Why is EC2 retiring my instance?\\nEC2 may schedule instances for retirement in cases where there is an unrecoverable issue with the underlying hardware. For more information about scheduled retirement events please see the EC2 user guide (https://docs.aws.amazon.com/en_us/AWSEC2/latest/UserGuide/instance-retirement.html). \\n\\nIf you have questions or issues, contact AWS Support at: https://aws.amazon.com/support ."
      }
    ],
    "affectedEntities": [
      {
        "entityValue": "i-04edd024e71b8b746"
      }
    ]
  }
}
